Revit 2024 API
VertexIndexPair Members
The VertexIndexPair type exposes the following members.
Constructors
Name | Description
VertexIndexPair
Initializes a new instance of the VertexIndexPair class
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Bottom
The index of the vertex pair from the bottom profile.
Top
The index of the vertex pair from the top profile.
See Also
VertexIndexPair Class
Autodesk.Revit.DB Namespace